Revit 2027 API
CreateRelatedFileProgressChangedEventArgs.FullDownload Property
 Indicates if download the full data of the document, which will take longer than subsequent downloads.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool FullDownload { get; }
Public ReadOnly Property FullDownload As Boolean
	Get
public:
property bool FullDownload {
	bool get ();
}
member FullDownload : bool with get
Property Value
Boolean
See Also
Reference
CreateRelatedFileProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace